{
    "about":{
        "key":"about",
        "desc":"Matthew was born and raised in Woodhaven, Michigan, 20 miles south of Detroit. He spent his days drawing comic book characters, creating haunted house tours through his friends basements and acting in the Woodhaven High School's theater program. Matthew attended Michigan State University earning a B.A. in Advertising, where he concentrated on graphic design and marketing. After graduation Matthew moved to Chicago, where he worked as a designer and developer.<br/><br/>In 1999, he entered the Film and Video Program at Columbia College in Chicago, where he graduated with honors. During that time he founded uPressplay, an interactive website for independent artists to showcase their films and videos. Matthew also produced many of his own work, which he also showcased in montly screenings. uPressplay became the launching pad for many successes including, Stay Dead, Two Days in Limbo, Palooka, Roscoe Village, Sour Krauts, The Art of Pain, Farewell Darkness and Camel Town: The Musical.<br/><br/>uPressplay has produced over 25 Official Film Festival Selections and winning Best Dramatic Short at the Michigan Independent and NY International Film Festivals for Two Days in Limbo. Best Feature Film at the Delray Beach and Drake International Film Festivals for Farewell Darkness. And Audience Choice Award at the Sunscreen Film Festival for The Art of Pain. The comedy musical short, Camel Town, was an official selection of the Sunscreen Film Festival and also won the Audience Choice Award at the Chicago International Reel Shorts Film Festival.<br/><br/>Matthew moved to Los Angeles in 2011, working in entertainment industry as a designer, developer and editor. He also has written 2 feature lenght scripts and has produced several web videos and short films. Recently he won a W3 Best of Show award for his work on the How to Train Your Dragon franchise site and online card game."
    },
    "portfolio":[
        {
            "key":"thunderagents",
            "type":"dev",
            "title":"THUNDER AGENTS SITE",
            "desc":"Responsive site with dynamic scrolling functionality showcasing an upcoming franchise based on a series of comic books from the 60s.",
            "url":"http://www.thunderagents.com/",
            "tools":"jQuery, JS, Tweenmax, CSS3, JSON",
            "thumb":"img/thunderagents_thumb.jpg",
            "hires":"",
            "vid":""
        },
        {
            "key":"dirty-grandpa",
            "type":"dev",
            "title":"DIRTY GRANDPA SITE",
            "desc":"Responsive site utilizing Tumblr's api, pulling posts from the main Tumblr feed and dynamically loading based on user interaction.",
            "url":"http://www.dirtygrandpa.movie/",
            "tools":"UX, jQuery, JS, Tweenmax, CSS3, Tumblr",
            "thumb":"img/dirtygrandpa_thumb.jpg",
            "hires":"",
            "vid":""
        },
        {
            "key":"mcdick",
            "type":"dev",
            "title":"MCDICK SITE",
            "desc":"CMS driven responsive site with dynamically loading drawers for site content. Urls and social sharing dynamically generated for single page section navigation and SEO.",
            "url":"http://mcdickthemovie.com/",
            "tools":"UX, jQuery, JS, Tweenmax, CSS3, Tumblr",
            "thumb":"img/mcdick_thumb.jpg",
            "hires":"",
            "vid":""
        }
    ]
}